START_MESSAGE = """Вас приветствует бот по статистике игры в 21. Вы можете отслеживать игру здесь или добавить бота в канал, 
чтоб он присылал сообщения туда.

/help - помощь
/addchannel - добавить канал
/deletechannel - удаление канала"""


NO_RESPOND_MESSAGE = "Бот не отвечает на сообщения, нажмите /help чтоб узнать команды"


ADD_CHANNEL_MESSAGE = """*Добавление канала*

  1. Добавьте @blackjack_statbot в администраторы вашего канала.
  2. Перешлите мне любое сообщение из вашего канала"""


NOT_ADMIN_MESSAGE = "Бот не является администратором этого канала. "


SUCCESSFULLY_ADDED_MESSAGE = "Канал успешно добавлен. Сообщения из @blackjack_statbot будут публиковаться в вашем канале."


DELETE_CHANNEL_MESSAGE = "Выберите какой канал хотите удалить."


NO_ADDED_CHANNELS_MESSAGE = "Каналы не добавлены."


SUCCESSFULLY_DELETED_MESSAGE = "Канал успешно удалён."


HELP_MESSAGE = """Чтоб остановить рассылку нажмите /stop. 
Вы можете добавить свой канал и бот будет публиковать сообщения там. Чтобы добавить канал нажмите /addchannel. 
Чтоб бот перестал присылать сообщения в канал, нажмите /deletechannel. """

FORWARD_TO_ME_MESSAGE = "Перешлите мне сообщение из канала!"

CHANNEL_ALREADY_ADDED_MESSAGE = "Этот канал уже добавлен вами или кем-то другим"
